In [1]:
import warnings
warnings.filterwarnings(action='ignore') 

import pandas as pd
import numpy as np
import csv
import folium
import matplotlib.pyplot as plt
plt.rc('font',family='D2CodingLigature Nerd Font')

In [2]:
x=[0, 1, 2, 3, 4, 5]
y=[0, 2, 4, 6, 8, 10]
df=pd.DataFrame( )
df['x_value']=x
df['y_value']=y
df['xy_value'] = df['x_value'] * df['y_value']
df

   x_value  y_value  xy_value
0        0        0         0
1        1        2         2
2        2        4         8
3        3        6        18
4        4        8        32
5        5       10        50

In [3]:
i=['zero', 'one', 'two', 'three', 'four', 'five']
df['number']=i
df

   x_value  y_value  xy_value number
0        0        0         0   zero
1        1        2         2    one
2        2        4         8    two
3        3        6        18  three
4        4        8        32   four
5        5       10        50   five

In [4]:
# number 컬럼을 index로 설정

df1 = df.set_index('number')
df1

        x_value  y_value  xy_value
number
zero          0        0         0
one           1        2         2
two           2        4         8
three         3        6        18
four          4        8        32
five          5       10        50

In [5]:
df2 = df1.reset_index(drop=False)   ## 인덱스 초기화 (기존 인덱스는 새로운 컬럼으로 만든다)
df2

  number  x_value  y_value  xy_value
0   zero        0        0         0
1    one        1        2         2
2    two        2        4         8
3  three        3        6        18
4   four        4        8        32
5   five        5       10        50

In [6]:
df3 = df1.reset_index(drop=True)   ## 인덱스 초기화 (기존 인덱스는 버린다)
df3

   x_value  y_value  xy_value
0        0        0         0
1        1        2         2
2        2        4         8
3        3        6        18
4        4        8        32
5        5       10        50